{
  "_name_or_path": "google/pix2struct-docvqa-large",
  "architectures": [
    "Pix2StructForConditionalGeneration"
  ],
  "decoder_start_token_id": 0,
  "eos_token_id": 1,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "is_encoder_decoder": true,
  "is_vqa": false,
  "model_type": "pix2struct",
  "pad_token_id": 0,
  "text_config": {
    "d_ff": 3968,
    "encoder_hidden_size": 1536,
    "hidden_size": 1536,
    "initializer_range": 0.02,
    "model_type": "pix2struct_text_model",
    "num_heads": 24,
    "num_layers": 18
  },
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.37.2",
  "vision_config": {
    "d_ff": 3968,
    "hidden_size": 1536,
    "initializer_range": 0.02,
    "layer_norm_bias": false,
    "model_type": "pix2struct_vision_model",
    "num_attention_heads": 24,
    "num_channels": 3,
    "num_hidden_layers": 18,
    "patch_size": 16,
    "projection_dim": 768
  }
}
